kafka_benchmark_results_20251002_003914/batch-optimized/producer-test.log
4996 records sent, 999.0 records/sec (0.98 MB/sec), 5.4 ms avg latency, 301.0 ms max latency.
5008 records sent, 1000.4 records/sec (0.98 MB/sec), 4.6 ms avg latency, 10.0 ms max latency.
12000 records sent, 999.500250 records/sec (0.98 MB/sec), 4.92 ms avg latency, 301.00 ms max latency, 5 ms 50th, 8 ms 95th, 14 ms 99th, 24 ms 99.9th.